package by.htp.homework1.linear.main;

public class Task15 {
	//15. Написать программу, которая выводит на экран первые четыре степени числа π.
	public static void main(String[] args) {
		System.out.println("task15");
		double p = Math.PI;
		System.out.printf("%.4f%n", p);
	}
}
